app/views/admin/items/edit.html.erb

        <div class="form">
          <%= f.collection_select(:genre_id, Genre.all, :id, :name, {}, {class:"select-box"}) %>
---
SELECT "genres".* FROM "genres"