app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
        <div class="form">
          <%= f.collection_select(:genre_id, Genre.all, :id, :name, {}, {class:"select-box", id:"mentor-skill"}) %>