app/controllers/admin/genres_controller.rb

SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
   def index
      @genres = Genre.page(params[:page]).reverse_order

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2021-10-26 09:52:09.927329"], ["updated_at", "2021-10-26 09:52:09.927329"]]
---
   def create
      genre = Genre.new(genre_params)
      genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def edit
      @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def update
      genre = Genre.find(params[:id])