app/controllers/admin/homes_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
   def top
      @orders = Order.page(params[:page]).reverse_order