app/controllers/admin/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
   def index
      @items = Item.page(params[:page]).reverse_order

INSERT INTO "items" ("genre_id", "image_id", "introduction", "price", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?, ?)
---
   def create
      @item = Item.new(item_params)
      @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def show
      @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def edit
      @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "de84ddfebfa3daa8aa51a3c30c69d1a0c7bd94f2877a982b1fba76c4d98e"], ["is_active", 0], ["updated_at", "2021-11-26 06:58:23.444138"], ["id", 3]]
---
   def update
      item = Item.find(params[:id])
      item.update(item_params)