app/controllers/admin/orders_controller.rb

  def show
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]