app/views/admin/orders/show.html.erb

      <tr>
        <td><%= order.order_detail.item.name %></td>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 13]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]