app/views/admin/homes/top.html.erb

SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 12]]
---
        <td><%= order.name %></td>
        <% order.order_details.each do|order_detail| %><% @all_amount += order_detail.amount %><% end %>