app/controllers/public/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(addresses_params)
    @address.customer_id = current_customer.id
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 4], ["name", "誰か"], ["postal_code", "1000000"], ["address", "秘密"], ["created_at", "2021-11-27 08:18:11.782140"], ["updated_at", "2021-11-27 08:18:11.782140"]]

  def edit
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    address = Address.find(params[:id])
    address.customer_id = current_customer.id
    address.update(addresses_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "山だ"], ["updated_at", "2021-11-02 08:31:08.151917"], ["id", 1]]

  def destroy
    address = Address.find(params[:id])
    address.customer_id = current_customer.id
    address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]