app/controllers/public/cart_items_controller.rb

  def update
    cart_item = CartItem.find(params[:id])
    cart_item.customer_id = current_customer.id
    cart_item.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-11-05 07:09:33.084820"], ["id", 4]]

  def destroy
    cart_item = CartItem.find(params[:id])
    cart_item.customer_id = current_customer.id
    cart_item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def destroy_all
    cart_items = CartItem.all
    cart_item.customer_id = current_customer.id
    cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items"
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 6]]

  def create
    @cart_item = CartItem.new(item_id: cart_item_params[:item_id], amount: cart_item_params[:amount], customer_id: current_customer.id)
    @cart_item.save
---
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 4], ["amount", 1], ["created_at", "2021-11-04 10:00:34.158042"], ["updated_at", "2021-11-04 10:00:34.158042"]]