app/controllers/public/customers_controller.rb

  def update
    customer = current_customer
    customer.update(customer_params)
---
UPDATE "customers" SET "email" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["email", "hanahana@gmail.com"], ["postal_code", "2222223"], ["address", "花々"], ["telephone_number", "22222222223"], ["updated_at", "2021-11-28 05:09:21.073793"], ["id", 7]]

  def withdraw
    @customer = Customer.find(current_customer.id)
    @customer.is_deleted = true
    @customer.update(is_deleted: true)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-11-26 07:22:00.568531"], ["id", 5]]