app/controllers/public/homes_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def top
    @genres = Genre.all
    @items = Item.page(params[:page]).reverse_order
    @items_count = Item.count