app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
SELECT "genres".* FROM "genres"
---
  def index
    @items = Item.page(params[:page]).reverse_order
    @genres = Genre.all

SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @genres = Genre.all
    @item = Item.find(params[:id])