app/controllers/public/orders_controller.rb

  def confirm
    @order = Order.new
    @cart_items = current_customer.cart_items
    @order.shipping_cost = 800
    @order.payment_method = params[:order][:payment_method]
    if params[:order][:select_address] == "0"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.first_name + current_customer.last_name
    elsif params[:order][:select_address] == "1"
      @address = Address.find(params[:order][:current_customer_address_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 4]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @cart_items = current_customer.cart_items
    #@order = Order.new(order_params)
    @order.customer_id = current_customer.id

    item = []
    @cart_items.each do |i|
      item << @order.order_details.new(
        order_id: @order.id,
        item_id: i.item_id,
        price: i.item.price,
        amount: i.amount
        )

    end
    OrderDetail.import(item)
    @order.save
#カートの削除機能をつける
    current_customer.cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 4]]
INSERT INTO "order_details" ("id","order_id","item_id","price","amount","created_at","updated_at") VALUES (NULL,14,7,220,2,'2021-11-27 07:34:59.880861','2021-11-27 07:34:59.880861'),(NULL,14,6,200,2,'2021-11-27 07:34:59.880861','2021-11-27 07:34:59.880861'),(NULL,14,4,240,3,'2021-11-27 07:34:59.880861','2021-11-27 07:34:59.880861')
INSERT INTO "orders" ("customer_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["customer_id", 4], ["created_at", "2021-11-18 07:55:56.055795"], ["updated_at", "2021-11-18 07:55:56.055795"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 15], ["item_id", 7], ["price", 220], ["amount", 1], ["created_at", "2021-11-27 08:09:00.369695"], ["updated_at", "2021-11-27 08:09:00.369695"]]
INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "shipping_cost", "total_payment", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 42]]

  def index
    @orders = current_customer.orders.page(params[:page]).reverse_order
---
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["customer_id", 4], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 4]]

  def show
    @order =  Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]