app/controllers/public/sessions_controller.rb

  def reject_inactive_customer
    @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "ku.l.taf54@gmail.com"], ["LIMIT", 1]]