app/views/public/orders/index.html.erb

        <td><%= order.postal_code %><br><%= order.address %><br><%= order.name %></td>
        <td><% order.order_details.each do|order_detail| %><%= order_detail.item.name %><br><% end %></td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 12]]