app/views/public/orders/new.html.erb

  <%= f.radio_button :select_address, 1,class:"ms-2" %>
  <%= f.select :current_customer_address_id, options_from_collection_for_select(Address.all, :id, :full_address),class:"ms-2 mb-2" %><br>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 6]]